<div style="direction:rtl;line-height:300%;">
<div align=center>
<font face="B Nazanin" size=3>
    به نام خدا
    </font>
    <br>
    <br>
    <font face="B Nazanin" size=5>
        <font color=#FF7500>
      آکادمی همراه اول
        </font>
           <br> <br>
        دورۀ آشنایی با پایتون
        <br>
        <br>
<b>        آشنایی با کتابخانۀ Pandas
</b> <br><br>   <b>  جمال کزازی </b>
            <p> </p>
    </font>
    </div>
    </div>

<hr>
<font face="B Nazanin"> 
    <h2>
       و اما Pandas...
    </h2>
    <br>
    <font size=3>
        <p> </p>
Pandas یکی از کتابخانه‌های پایتون است که با هدف کار با مجموعه‌های داده طراحی گردیده است. این کتابخانه شامل توابعی است که می‌توان با آن‌ها داده‌ها را آنالیز کرد، تفکیک کرد و حتی به هم مرتبط کرد. با استفاده از توابع این کتابخانه می‌توان با داده‌های بزرگ (Big Data) را مدیریت کرد و شاخصه‌های آماری آن‌ها را به‌دست آورد. با توجه به خصوصیاتی که از این کتابخانه عنوان شد، در علوم داده نمی‌توان از آن چشم پوشاند!
    </font>
    </font>

<center><img src='Pandas_logo_.png' width=60% height=60%></center>

<font face="B Nazanin"> 
    <br>
    <font size=3>
        <p> </p>
برای شروع کار با Pandas، ابتدا آن را import می‌کنیم و در ادامه برای مثال یک جدول از نمرات یک کلاس فرضی ایجاد می‌کنیم.
    </font>
    </font>

In [1]:
import pandas as pd

dataset = {'Name':['John', 'Alice', 'Bob', 'Tom'], 'Score':[60, 80, 90, 75]}
dataframe = pd.DataFrame(dataset)
dataframe

    Name  Score
0   John     60
1  Alice     80
2    Bob     90
3    Tom     75

<hr>
<font face="B Nazanin"> 
    <h2>
     Series پاندایی! 
    </h2>
    <br>
    <font size=3>
        <p> </p>
هر Series مانند یک ستون در جدول است و برداری از داده‌هاست که می‌تواند شامل داده‌های مختلف شود. یک جدول داده از Series های مختلفی تشکیل می‌شود. برای تشکیل یک Series از pd.Series استفاده می‌کنیم. هم‌چنین می‌توان با استفاده از لیبل هر داده به محتوای آن در Series دسترسی پیدا کنیم.
    </font>
    </font>

<center><img src='series.png' width=60% height=60%></center>

In [39]:
s1 = [10, 15, 18, 19.5, 17]
series_1 = pd.Series(s1)
print(series_1)
print('\n', series_1[2])

0    10.0
1    15.0
2    18.0
3    19.5
4    17.0
dtype: float64

 18.0

<font face="B Nazanin"> 
    <font size=3>
        <p> </p>
لیبل هر داده در Series می‌تواند غیر از عدد باشد. یعنی به جای این که از 0, 1, 2, ... استفاده شود می‌توان از حروف هم استفاده کرد.

برای تولید یک Series می‌توان از ساختارهایی مانند دیکشنری هم کمک گرفت. هم‌چنین می‌توانیم صرفا داده‌هایی را با لیبل خاصی در Series قرار دهیم.
    </font>
    </font>

In [40]:
series_2 = pd.Series(s1, index = ['A', 'B', 'C', 'D', 'E'])
print(series_2)
print('\n', series_2['D'], '\n')

s2 = {'a':17, 'b':16, 'c':20, 'd':16.5, 'e':17.25} 
series_3 = pd.Series(s2) 
print(series_3, '\n')

series_4 = pd.Series(s2, index = ['b', 'e']) # selective addition
print(series_4)

A    10.0
B    15.0
C    18.0
D    19.5
E    17.0
dtype: float64

 19.5

a    17.00
b    16.00
c    20.00
d    16.50
e    17.25
dtype: float64

b    16.00
e    17.25
dtype: float64

<hr>
<font face="B Nazanin"> 
    <h2>
    DataFrame و آن‌چه هست ... 
    </h2>
    <br>
    <font size=3>
        <p> </p>
اگر Series مانند یک ستون جدول باشد، DataFrame مانند کل جدول است. هر DataFrame از چندین Series تشکیل شده است. می‌توان گفت که DataFrame یک ساختار 2-بعدی است. در مثال زیر یک جدول از داده‌ها تشکیل داده‌ایم.
        
برای نمایش اطلاعات ردیف مورد نظر می‌توان از لیبل آن و متد loc استفاده کرد. مثلا ردیف سوم را نمایش می‌دهیم. هم‌چنین مانند Series می‌توان ردیف‌ها را با پارامتر index لیبل‌گذاری کرد.
    </font>
    </font>

In [6]:
data_frame = {'Name':['John', 'Alice', 'Bob', 'Tom', 'Michael'], 'Score':[100, 83, 96, 78, 71], 'Age': [19, 19, 20, 21, 20]}
dataframe = pd.DataFrame(data_frame) #creation a dataframe
print(dataframe)
print('\n', 'information of 3rd row:\n', dataframe.loc[2]) 
dataframe_2 = pd.DataFrame(data_frame, index = ['a', 'b', 'c', 'd', 'e']) #indexing DataFrame 
print('\n', dataframe_2)
print('================\n',dataframe_2.loc['a'])

      Name  Score  Age
0     John    100   19
1    Alice     83   19
2      Bob     96   20
3      Tom     78   21
4  Michael     71   20

 information of 3rd row:
 Name     Bob
Score     96
Age       20
Name: 2, dtype: object

       Name  Score  Age
a     John    100   19
b    Alice     83   19
c      Bob     96   20
d      Tom     78   21
e  Michael     71   20
================
 Name     John
Score     100
Age        19
Name: a, dtype: object

<hr>
<font face="B Nazanin"> 
    <h2>
ذخیره و بازآوری اطلاعات
    </h2>
    <br>
    <font size=3>
        <p> </p>
برای ذخیره و نگهداری اطلاعات با حجم زیاد می‌توان از فرمت‌های مختلف استفاده کرد و یکی از معروف‌ترین آن‌ها csv است. csv یک فرمت پراستفاده است که در آن اطلاعات با کاما از هم تفکیک شده‌اند.
        
برای ذخیرۀ اطلاعات از متد to_csv استفاده می‌کنیم و می‌توانیم داده‌های یک DataFrame را درون یک فایل ذخیره کنیم. برای این که اطلاعات یک فایل را بازآوری کنیم نیز از متد read_csv استفاده می‌کنیم.
    </font>
    </font>

<center><img src='csv.png' width=40% height=40%></center>

In [7]:
dataframe.to_csv('data.csv')
read_df = pd.read_csv('data.csv')
read_df

   Unnamed: 0     Name  Score  Age
0           0     John    100   19
1           1    Alice     83   19
2           2      Bob     96   20
3           3      Tom     78   21
4           4  Michael     71   20

<hr>
<font face="B Nazanin"> 
    <h2>
افزودن ستون به DataFrame
    </h2>
    <br>
    <font size=3>
        <p> </p>
در صورتی که بخواهیم یک ستون به DataFrame اضافه کنیم و یک شاخصه جدید به اطلاعات خود بیافزاییم می‌توانیم از روش زیر استفاده کنیم:
    </font>
    </font>

In [8]:
class_no = [1, 1, 2, 1, 2]
dataframe['Class'] = class_no
dataframe

      Name  Score  Age  Class
0     John    100   19      1
1    Alice     83   19      1
2      Bob     96   20      2
3      Tom     78   21      1
4  Michael     71   20      2

<hr>
<font face="B Nazanin"> 
    <h2>
مرتب کردن مقادیر DataFrame بر اساس ستون
    </h2>
    <br>
    <font size=3>
        <p> </p>
برخی مواقع دیده‌ایم که اطلاعات یک جدول برای ما مرتب نبوده و نیاز به مرتب‌سازی آن دیده شده است. مثلا می‌خواهیم لیسن کلاس درس را بر اساس ترتیب نام افراد داشته باشیم. برای این کار باید مرتب‌سازی را بر اساس یک ستون (ستون اسامی افراد کلاس) انجام دهیم. در Pandas می‌توانیم اطلاعات DataFrame را بر اساس مقادیر هر ستون که در نظر بگیریم به صورت صعوی یا نزولی مرتب سازیم. این کار با استفاده از متد sort_values صورت می‌گیرد. 
    </font>
    </font>

In [9]:
dataframe.sort_values("Name", axis = 0, ascending = True, inplace = True, na_position ='last') # sort as Name
print(dataframe)
dataframe.sort_values("Age", axis = 0, ascending = True, inplace = True, na_position ='last') # sort as Age
print(dataframe)

      Name  Score  Age  Class
1    Alice     83   19      1
2      Bob     96   20      2
0     John    100   19      1
4  Michael     71   20      2
3      Tom     78   21      1
      Name  Score  Age  Class
1    Alice     83   19      1
0     John    100   19      1
2      Bob     96   20      2
4  Michael     71   20      2
3      Tom     78   21      1

<hr>
<font face="B Nazanin"> 
    <h2>
دسته‌بندی داده‌ها (Groupby)
    </h2>
    <br>
    <font size=3>
        <p> </p>
یکی از قابلیت‌های که هنگام کار با اطلاعات حجیم به دنبال آن می‌گردیم آن است که بتوانیم داده‌ها را دسته‌بندی کنیم و بر روی هر دسته تابع دلخواه را اجرا کنیم. دسته‌بندی اطلاعات باید بر اساس یک مبنا باشد که در اینجا اساس دسته‌بندی را مقادیر یکی یا چندتا از ستون‌ها در نظر می‌گیریم. مفهوم اصلی دسته‌بندی در Pandas به نام Groupby شناخته می‌شود. در واقع هدف از دسته‌بندی اعمال تابعی مشخص بر روی اطلاعات مشخص می‌باشد. حال این فرآیند را می‌توان در 3 مرحله نشان داد:
        
- Splitting: این مرحله همان دسته‌بندی اطلاعات در گروه‌ها براساس شاخصه‌های مختلف است.
- Applying: در این مرحله تابع مدنظر به هر کدام از دسته‌های دلخواه اعمال می‌شود.
- Combining: پس از اعمال توابع مورد نیاز، مجموعه داده‌های مختلف را با هم یکی می‌کنیم و یک مجموعه کلی به‌دست می‌آوریم.
    </font>
    </font>

<font face="B Nazanin"> 
    <h3>
Splitting (تقسیم‌بندی)
    </h3>
    <br>
    <font size=3>
        <p> </p>
برای تقسیم‌بندی داده‌ها در یک مجموعه داده نیاز داریم تا بر اساس شرایطی این کار را انجام دهیم. مثلا می‌توانیم افراد یک مدرسه را بر اساس شماره کلاس آن‌ها دسته‌بندی کنیم. می‌توانیم با متد first اولین مقدار هر گروه را چاپ کنیم.
    </font>
    </font>

In [10]:
class_groups = dataframe.groupby('Class') # make groups from class number
class_groups.first()

        Name  Score  Age
Class
1      Alice     83   19
2        Bob     96   20

<font face="B Nazanin"> 
    <font size=3>
        <p> </p>
می‌توان تقسیم‌بندی را نیز بر اساس چندین شاخصه از DataFrame انجام داد. برای مثال در نمونه بالا بر اساس Class و Age دسته‌بندی را انجام می‌دهیم.
    </font>
    </font>

In [11]:
new_group = dataframe.groupby(['Class', 'Age'])
print(new_group.groups)

{(1, 19): [1, 0], (1, 21): [3], (2, 20): [2, 4]}

<font face="B Nazanin"> 
    <h3>
Applying (اعمال تابع)
    </h3>
    <br>
    <font size=3>
        <p> </p>
پس از این که تقسیم‌بندی دلخواه ما شکل گرفت می‌توانیم مقادیر هر گروه را به صورت‌های مختلف بخوانیم و هم‌چنین توابع دلخواه را بر روی آن اجرا کنیم. هم‌چنین می‌توان گروه مدنظر را با استفاده از متد get_group بگیریم. 
    </font>
    </font>

In [12]:
for name,group in new_group:
    print(name)
    print(group, '\n')
    
class_groups.get_group(1) # get information of class #1

(1, 19)
    Name  Score  Age  Class
1  Alice     83   19      1
0   John    100   19      1

(1, 21)
  Name  Score  Age  Class
3  Tom     78   21      1

(2, 20)
      Name  Score  Age  Class
2      Bob     96   20      2
4  Michael     71   20      2

    Name  Score  Age  Class
1  Alice     83   19      1
0   John    100   19      1
3    Tom     78   21      1

In [13]:
new_group.get_group((1, 19)) # get information of class #1 with age 19

    Name  Score  Age  Class
1  Alice     83   19      1
0   John    100   19      1

<font face="B Nazanin"> 
    <br>
    <font size=3>
        <p> </p>
اعمال توابع بر روی هر گروه از داده‌ها را می‌توان به دست‌های زیر تقسیم کرد:
    
- Aggregation: در این دسته از اعمال، توابع آماری بر روی هر گروه صورت می‌گیرد..
- Transformation: در این نوع برخی محاسبه‌های درون گروهی صورت می‌گیرد و برخی مقادیر گروه تغییر می‌کند.
- Filteration: در این نوع فرآیند، بر اساس برخی محاسبات بردارهای فیلتر(True, False) به‌دست می‌آید.
        
        
        
حال در ابتدا به Aggregation می‌پردازیم:
    </font>
    </font>

In [14]:
import numpy as np
class_groups.aggregate(np.sum)

       Score  Age
Class
1        261   59
2        167   40

In [15]:
new_group.aggregate(np.sum)

           Score
Class Age
1     19     183
      21      78
2     20     167

In [16]:
class_groups['Age'].agg([np.sum, np.mean, np.std]) # calculate statistical features of Age

       sum       mean       std
Class
1       59  19.666667  1.154701
2       40  20.000000  0.000000

<font face="B Nazanin"> 
    <br>
    <font size=3>
        <p> </p>
Transformation به این صورت است که برخی محاسبات گروه-محور انجام می‌شود و مقادیری از این محاسبات برمی‌گردد که داده‌های group را تغییر می‌دهد.
    </font>
    </font>

In [18]:
tf = lambda x: (x**2)-20*x+3-x.std()
class_groups.transform(tf)

C:\Users\a\AppData\Local\Temp/ipykernel_13964/3942993081.py:2: FutureWarning: Dropping invalid columns in DataFrameGroupBy.transform is deprecated. In a future version, a TypeError will be raised. Before calling .transform, select only columns which should be valid for the transforming function.
  class_groups.transform(tf)

         Score        Age
1  5220.467437 -17.154701
0  7991.467437 -17.154701
2  7281.322330   3.000000
4  3606.322330   3.000000
3  4515.467437  22.845299

<font face="B Nazanin"> 
    <br>
    <font size=3>
        <p> </p>
Filteration همان‌طور  که از اسمش مشخص است برای فیلتر کردن داده‌ها و به‌دست آوردن بردار فیلتر (True, Flase) است.
    </font>
    </font>

In [19]:
filt = lambda x: len(x) == 1 
new_group.filter(filt)

  Name  Score  Age  Class
3  Tom     78   21      1